Revit 2027 API
FilledRegion.IsValidLineStyleIdForFilledRegion Method
 Indicates whether the given Id is a valid line style Id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidLineStyleIdForFilledRegion(
	Document document,
	ElementId lineStyleId
)
Public Shared Function IsValidLineStyleIdForFilledRegion (
	document As Document,
	lineStyleId As ElementId
) As Boolean
public:
static bool IsValidLineStyleIdForFilledRegion(
	Document^ document,
	ElementId^ lineStyleId
)
static member IsValidLineStyleIdForFilledRegion :
        document : Document *
        lineStyleId : ElementId -> bool
Parameters
document Document
 The document.
lineStyleId ElementId
 The line style Id.
Return Value
Boolean
 True if it is a valid line style Id, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilledRegion Class
Autodesk.Revit.DB Namespace